doe/remote_snapshot/openfoam_case_rans_doe_30deg_cases/case_10/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  16;
method              scotch;
